#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.lambda_s3.module.lambda-make-replacements.data.external.archive_prepare[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.external.archive_prepare[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.external.archive_prepare[0]: Reading...
module.data.module.metadata-db.random_password.master_password[0]: Refreshing state... [id=none]
module.data.random_password.password: Refreshing state... [id=none]
module.data.module.metadata-db.random_id.snapshot_identifier[0]: Refreshing state... [id=dBZVvg]
module.lambda_s3.module.lambda-validate-replacements.data.external.archive_prepare[0]: Reading...
module.lambda_s3.random_pet.this: Refreshing state... [id=measured-asp]
module.lambda_s3.module.lambda-update-legislation-table.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_s3.module.lambda-update-legislation-table.local_file.archive_plan[0]: Refreshing state... [id=2f7797e2db05d642fe43f3675f12c57f80f69dec]
module.lambda_s3.module.lambda-update-legislation-table.null_resource.archive[0]: Refreshing state... [id=8164697666227387797]
module.lambda_s3.module.lambda-make-replacements.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_s3.module.lambda-make-replacements.local_file.archive_plan[0]: Refreshing state... [id=a8fea5bdf7852dccfec8598d2c1e615945cb562a]
module.lambda_s3.module.lambda-extract-judgement-contents.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_s3.module.lambda-make-replacements.null_resource.archive[0]: Refreshing state... [id=1925074530588469736]
module.lambda_s3.module.lambda-extract-judgement-contents.local_file.archive_plan[0]: Refreshing state... [id=c09f1b3e2933dc66f31779092e2c3b0cdc9814f9]
module.lambda_s3.module.lambda-extract-judgement-contents.null_resource.archive[0]: Refreshing state... [id=9045320330699222395]
module.lambda_s3.module.lambda-validate-replacements.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_s3.module.lambda-validate-replacements.local_file.archive_plan[0]: Refreshing state... [id=c94cd84e78147a36dbec2f6aa84c1ae056f90cfc]
module.lambda_s3.module.lambda-validate-replacements.null_resource.archive[0]: Refreshing state... [id=1790531596193177970]
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-replacements-abbreviations]
module.lambda_s3.module.xml_second_phase_enriched_bucket.aws_kms_key.this[0]: Refreshing state... [id=dce4a465-2c1b-47cd-90d9-ca74da973ee8]
module.lambda_s3.aws_sqs_queue.validation_updates_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-queue]
module.lambda_s3.module.xml_third_phase_enriched_bucket.aws_kms_key.this[0]: Refreshing state... [id=f46f9937-e624-441e-bde2-36f5b1d8602a]
module.lambda_s3.module.xml_original_bucket.aws_kms_key.this[0]: Refreshing state... [id=d7044516-a847-4a57-9da7-af53e83880f5]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.xml_enriched_bucket.aws_kms_key.this[0]: Refreshing state... [id=5691ca21-acbf-4c32-a8c8-4875889d9919]
module.lambda_s3.module.container_bucket.aws_kms_key.this[0]: Refreshing state... [id=6bbabc6a-f828-40cf-9f7a-677f9777814b]
module.lambda_s3.module.lambda-update-rules-processor.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-update-rules-processor]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.aws_sqs_queue.validation_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-dlq-queue]
module.lambda_s3.aws_ecr_repository.legislation: Refreshing state... [id=tna-s3-tna-ecr-repository-legislation-production]
module.lambda_s3.aws_ecr_repository.legislation-update: Refreshing state... [id=tna-s3-tna-ecr-repository-legislation-update-production]
module.lambda_s3.aws_sqs_queue.validation_updates_error_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-error-queue]
module.lambda_s3.aws_ecr_repository.main: Refreshing state... [id=tna-s3-tna-ecr-repository-production]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.text_content_bucket.aws_kms_key.this[0]: Refreshing state... [id=2f64d54a-6055-40c5-a540-64b32758b99f]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_sqs_queue.validation_updates_error_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-error-dlq-queue]
module.lambda_s3.aws_sqs_queue.replacements-abbreviations_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-abbreviations-dlq-queue]
module.lambda_s3.aws_secretsmanager_secret.sparql_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-s3-tna-sparql-password-production-wMXZCD]
module.lambda_s3.aws_secretsmanager_secret.sparql_username: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-s3-tna-sparql-username-production-BOgQQF]
module.lambda_s3.aws_ecr_repository.rules-update: Refreshing state... [id=tna-s3-tna-ecr-repository-rules-update-production]
module.lambda_s3.aws_sqs_queue.replacements-legislation_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-legislation-dlq-queue]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_partition.current: Read complete after 0s [id=aws]
module.data.aws_secretsmanager_secret.postgress_master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-postgress-password-production-quaE0B]
module.lambda_s3.aws_sns_topic.abbreviation_detection_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:abbreviation-detection-error-topic]
module.lambda_s3.aws_sns_topic.oblique_references_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:oblique-references-error-topic]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-extract-judgement-contents]
module.lambda_s3.aws_sns_topic.rules_update_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:rules-update-error-topic]
module.data.module.metadata-db.data.aws_partition.current: Reading...
module.data.module.metadata-db.data.aws_partition.current: Read complete after 0s [id=aws]
module.data.module.metadata-db.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-legislation-provisions]
module.lambda_s3.aws_sqs_queue.replacements-caselaw_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-caselaw-dlq-queue]
module.data.module.metadata-db.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.data.aws_db_parameter_group.example: Refreshing state... [id=tna-aurora-db-postgres11-parameter-group]
module.lambda_s3.aws_ecr_repository.oblique-references: Refreshing state... [id=tna-s3-tna-ecr-repository-oblique-references-production]
module.lambda_s3.module.replacements_bucket.aws_kms_key.this[0]: Refreshing state... [id=034b72b5-edcf-4b5d-a074-0eaf9f88f6cd]
module.lambda_s3.aws_sns_topic.legislation_update_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-update-error-topic]
module.lambda_s3.aws_sqs_queue.validation_updates_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-dlq-queue]
module.lambda_s3.module.lambda-make-replacements.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-make-replacements]
module.lambda_s3.aws_sns_topic.validation_updates_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-replacements-caselaw]
module.lambda_s3.module.lambda-validate-replacements.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-validate-replacements.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-xml-validate]
module.lambda_s3.aws_sns_topic.caselaw_detection_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:caselaw-detection-error-topic]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-update-legislation-table.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-update-legislation-table]
module.lambda_s3.module.lambda-make-replacements.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_ecr_repository.abbreviations: Refreshing state... [id=tna-s3-tna-ecr-repository-abbreviations-production]
module.network.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ec26bfba14257703]
module.lambda_s3.aws_sns_topic.make_replacements_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:make-replacements-error-topic]
module.lambda_s3.module.rules_bucket.aws_kms_key.this[0]: Refreshing state... [id=b74573dd-48ef-4d5f-a0b7-c52618e18e38]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-update-rules-processor.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_sqs_queue.replacements_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-dlq-queue]
module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0725f2fedcc386c04]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_ecr_repository.legislation-provision: Refreshing state... [id=tna-s3-tna-ecr-repository-legislation-provision-production]
module.lambda_s3.aws_sns_topic.legislation_provisions_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-provisions-error-topic]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-replacements-legislation]
module.data.aws_rds_cluster_parameter_group.example: Refreshing state... [id=tna-aurora-postgres11-cluster-parameter-group]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_sns_topic.validation_updates: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-topic]
module.lambda_s3.module.lambda-determine-oblique-references.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-oblique-references]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents]
module.lambda_s3.aws_sns_topic.extract_judgement_contents_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:extract-judgement-contents-error-topic]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions]
module.lambda_s3.aws_cloudwatch_event_rule.update_legislation_table_lambda_event_rule: Refreshing state... [id=update-legislation-table-lambda-event-rule]
module.lambda_s3.aws_sns_topic.legislation_detection_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-detection-error-topic]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor]
module.lambda_s3.aws_sqs_queue.validation-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-event-notification-queue]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations]
module.lambda_s3.module.xml_enriched_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-enriched-bucket-kms-key]
module.lambda_s3.module.xml_third_phase_enriched_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-third-phase-enriched-bucket-kms-key]
module.lambda_s3.module.xml_original_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-original-bucket-kms-key]
module.lambda_s3.module.container_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-container-bucket-kms-key]
module.lambda_s3.module.xml_second_phase_enriched_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-second-phase-enriched-bucket-kms-key]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table]
module.lambda_s3.aws_sqs_queue.replacement-abbreviations-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-abbreviations-event-notification-queue]
module.lambda_s3.module.text_content_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-text-content-bucket-kms-key]
module.data.aws_secretsmanager_secret_version.postgress_master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-postgress-password-production-quaE0B|1EE64283-60AC-44D5-A66D-5A8AE663E9B2]
module.lambda_s3.aws_sqs_queue.replacement-legislation-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-legislation-event-notification-queue]
module.lambda_s3.aws_cloudwatch_metric_alarm.abbreviation_detection_error: Refreshing state... [id=Abbreviation detection error]
module.lambda_s3.aws_sns_topic_subscription.abbreviation-detection-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:abbreviation-detection-error-topic:7ba6b297-5aa4-49e6-bfc9-48538475dffd]
module.lambda_s3.aws_sns_topic_subscription.oblique-references-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:oblique-references-error-topic:02a0c89b-844f-42b3-bdb9-aeb3e5268697]
module.lambda_s3.aws_cloudwatch_metric_alarm.oblique-references_error: Refreshing state... [id=Oblique references error]
module.lambda_s3.aws_sqs_queue.replacement-caselaw-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-caselaw-event-notification-queue]
module.lambda_s3.aws_sns_topic_subscription.rules-error-email-dan-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:rules-update-error-topic:382ef4ce-d549-4c9a-b05f-2a1fd2e1a3db]
module.lambda_s3.aws_sns_topic_subscription.rules-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:rules-update-error-topic:b29ed7a3-a5de-4815-9528-80b495e1712c]
module.lambda_s3.aws_cloudwatch_metric_alarm.rules_update_error: Refreshing state... [id=Manifest update error]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate]
module.lambda_s3.aws_sns_topic_subscription.legislation-update-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-update-error-topic:b5f84a45-9390-4f4f-ac02-b76d396c9c59]
module.lambda_s3.aws_cloudwatch_metric_alarm.legislation_update_error: Refreshing state... [id=Legislation update error]
module.lambda_s3.aws_sns_topic_subscription.validation_updates_error_sqs_target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic:19aea0df-cb17-4a60-b10b-e209dffe2b49]
module.lambda_s3.aws_sns_topic_subscription.validation-error-email-dan-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic:9a21e128-a6e5-4e5b-ada6-d84bc2b2d8fe]
module.lambda_s3.aws_sns_topic_subscription.validation-error-email-niall-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic:b5de4075-82a8-46a3-aee7-888d9f5bed58]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw]
module.lambda_s3.module.replacements_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-replacements-bucket-kms-key]
module.lambda_s3.aws_sns_topic_subscription.caselaw-detection-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:caselaw-detection-error-topic:30a5eebd-2888-465d-a602-dd05fd2c7dbb]
module.lambda_s3.aws_cloudwatch_metric_alarm.caselaw_detection_error: Refreshing state... [id=Case law detection error]
module.lambda_s3.aws_sns_topic_subscription.make-replacements-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:make-replacements-error-topic:093d9ebf-36a0-4c22-b658-08f6d00c25ab]
module.lambda_s3.aws_sqs_queue.replacements-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-queue]
module.lambda_s3.aws_cloudwatch_metric_alarm.make_replacements_error: Refreshing state... [id=Replacements error]
module.lambda_s3.module.rules_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-rules-bucket-kms-key]
module.lambda_s3.aws_sns_topic_subscription.legislation-provisions-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-provisions-error-topic:65f79a2a-86b9-4f65-9c9d-b3f7d41c0687]
module.lambda_s3.aws_cloudwatch_metric_alarm.legislation-provisions-error: Refreshing state... [id=Legislation provisions error]
module.lambda_s3.aws_sns_topic_subscription.validation_updates_sqs_target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-topic:7e7a09d2-6fc4-4440-b455-620747cfb9e4]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-20220630134149431400000001]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-20220630134149522500000002]
module.lambda_s3.module.xml_enriched_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-enriched-bucket]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-20220630134149671100000005]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-20220630134149618900000004]
module.lambda_s3.module.xml_third_phase_enriched_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-third-phase-enriched-bucket]
module.lambda_s3.module.xml_original_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-original-bucket]
module.lambda_s3.aws_sns_topic_subscription.extract_judgement_contents_error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:extract-judgement-contents-error-topic:b60a421a-624a-4fa0-915a-65a6a924e934]
module.lambda_s3.module.container_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-container-bucket]
module.lambda_s3.aws_cloudwatch_metric_alarm.extract-judgement-contents-error: Refreshing state... [id=Extract judgement contents error]
module.lambda_s3.module.xml_second_phase_enriched_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-second-phase-enriched-bucket]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-20220630134149806900000009]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-20220630134149804000000008]
module.lambda_s3.aws_sns_topic_subscription.legislation-detection-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-detection-error-topic:8496d661-8301-499c-85e6-4e15a394b63c]
module.lambda_s3.aws_cloudwatch_metric_alarm.legislation_detection_error: Refreshing state... [id=Legislation detection error]
module.lambda_s3.module.text_content_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-text-content-bucket]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-20220427202925220500000007]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-20220427202925208600000006]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094031907600000003]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094031848700000001]
module.lambda_s3.module.replacements_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-replacements-bucket]
module.lambda_s3.module.rules_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-rules-bucket]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1176325280]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=266729350]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-20220427202925002800000003]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-20220427202925091300000004]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-20220427202925655800000009]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-20220427202925571500000008]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1403257194]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=17487163]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3872817847]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=571018137]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=625191347]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3290068938]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=47217208]
module.network.data.aws_subnets.private: Reading...
module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06b211b2093d9386a]
module.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0b1d8f79187a7d21d]
module.network.data.aws_subnets.private: Read complete after 1s [id=eu-west-2]
module.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0b277ff77debc5626]
module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-087c076b252dc37c2]
module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01efa1af8517da831]
module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0acc9193f0ee3b071]
module.network.module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0d7ba71e45f7ab5dc]
module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-088c7e3e06dc5781a]
module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e54c3b6366c7757d]
module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-054799e9b0e828b66]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2875564545]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-rules-processor-logs]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-abbreviations-logs]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-extract-judgement-contents-logs]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-legislation-provisions-logs]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-caselaw-logs]
module.lambda_s3.module.lambda-make-replacements.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-make-replacements-logs]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-legislation-table-logs]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-xml-validate-logs]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-legislation-logs]
module.network.data.aws_subnet.private["subnet-01efa1af8517da831"]: Reading...
module.network.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Reading...
module.network.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Read complete after 0s [id=subnet-087c076b252dc37c2]
module.network.aws_vpc_endpoint.secrets_manager["subnet-01efa1af8517da831"]: Refreshing state... [id=vpce-00356813d8fd3cd88]
module.network.data.aws_subnet.private["subnet-01efa1af8517da831"]: Read complete after 0s [id=subnet-01efa1af8517da831]
module.network.aws_vpc_endpoint.secrets_manager["subnet-087c076b252dc37c2"]: Refreshing state... [id=vpce-0f96c81fa60ad2e45]
module.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=tna-network-vpc-production]
module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0db69f07ac9c5b962]
module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0eaba2ceacaec8bde]
module.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0635f4073668232a5]
module.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-00ac06519141b2c48]
module.network.module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-0d7ba71e45f7ab5dc1080289494]
module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06b211b2093d9386a1080289494]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-oblique-references-logs]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-2022063013415009100000000a]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-2022042720294337040000000b]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3630805794]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents-2022042720294427700000000d]
module.network.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b8f5e3c07bc8fabb]
module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dbaa914eb827c84f]
module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0224c4f97dd4ef418]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-2022063013415031910000000c]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-2022042720294425200000000c]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094032359700000004]
module.lambda_s3.module.lambda-make-replacements.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements-2022042720294437830000000f]
module.data.data.aws_vpc.vpc: Reading...
module.data.data.aws_subnets.public: Reading...
module.data.data.aws_subnets.private: Reading...
module.data.data.aws_subnets.database: Reading...
module.lambda_s3.module.lambda-validate-replacements.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate-20220427202944441100000010]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-2022042720294327780000000a]
module.lambda_s3.module.xml_enriched_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-enriched-bucket]
module.lambda_s3.module.xml_third_phase_enriched_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-third-phase-enriched-bucket]
module.lambda_s3.module.xml_original_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-original-bucket]
module.lambda_s3.module.container_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-container-bucket]
module.lambda_s3.module.xml_second_phase_enriched_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-second-phase-enriched-bucket]
module.lambda_s3.module.text_content_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-text-content-bucket]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-2022063013415011700000000b]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-legislation-table-inline]
module.lambda_s3.module.replacements_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-replacements-bucket]
module.lambda_s3.module.rules_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-rules-bucket]
module.data.module.metadata-db.aws_security_group.this[0]: Refreshing state... [id=sg-09faed2a726d79566]
module.data.data.aws_subnets.database: Read complete after 0s [id=eu-west-2]
module.data.data.aws_subnets.public: Read complete after 1s [id=eu-west-2]
module.data.data.aws_subnets.private: Read complete after 0s [id=eu-west-2]
module.network.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0acc9193f0ee3b0711080289494]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094031903400000002]
module.data.data.aws_subnet.database["subnet-0b277ff77debc5626"]: Reading...
module.data.data.aws_subnet.database["subnet-0b1d8f79187a7d21d"]: Reading...
module.data.data.aws_subnet.public["subnet-088c7e3e06dc5781a"]: Reading...
module.data.data.aws_subnet.public["subnet-054799e9b0e828b66"]: Reading...
module.data.data.aws_subnet.private["subnet-01efa1af8517da831"]: Reading...
module.data.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Reading...
module.data.module.metadata-db.aws_db_subnet_group.this[0]: Refreshing state... [id=tna-metadata-db-production]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2554887954]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1482319532]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=4724938]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents]
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3938526842]
module.lambda_s3.module.lambda-make-replacements.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements]
module.data.data.aws_subnet.database["subnet-0b277ff77debc5626"]: Read complete after 1s [id=subnet-0b277ff77debc5626]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=222784184]
module.data.data.aws_subnet.public["subnet-054799e9b0e828b66"]: Read complete after 1s [id=subnet-054799e9b0e828b66]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3238369102]
module.data.data.aws_subnet.database["subnet-0b1d8f79187a7d21d"]: Read complete after 1s [id=subnet-0b1d8f79187a7d21d]
module.data.data.aws_subnet.public["subnet-088c7e3e06dc5781a"]: Read complete after 1s [id=subnet-088c7e3e06dc5781a]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1037661573]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348118306]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-legislation-provisions-inline]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-oblique-references-inline]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1519427654]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-extract-judgement-contents-inline]
module.data.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Read complete after 1s [id=subnet-087c076b252dc37c2]
module.lambda_s3.module.lambda-make-replacements.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-make-replacements-inline]
module.data.data.aws_subnet.private["subnet-01efa1af8517da831"]: Read complete after 1s [id=subnet-01efa1af8517da831]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-rules-processor-inline]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-abbreviations-inline]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions]
module.lambda_s3.module.lambda-determine-oblique-references.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-legislation-inline]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-xml-validate-inline]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-caselaw-inline]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-20220630134149565800000003]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-20220630134149708200000006]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents-20220427203004315000000011]
module.lambda_s3.module.lambda-make-replacements.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements-20220427203017040500000015]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-20220630134149803700000007]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-20220427203011908400000012]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate-20220427203017047200000016]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-20220427203012648200000014]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-20220427203012638700000013]
module.data.module.metadata-db.aws_rds_cluster.this[0]: Refreshing state... [id=tna-metadata-db-production]
module.data.data.aws_vpc.vpc: Read complete after 2s [id=vpc-0725f2fedcc386c04]
module.lambda_s3.aws_s3_bucket_notification.xml_enriched_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-enriched-bucket]
module.lambda_s3.module.lambda-determine-oblique-references.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_legislation_event_source_mapping: Refreshing state... [id=b97e763c-8afc-402d-8978-f2fd27135f1e]
module.lambda_s3.aws_sqs_queue_policy.replacements-abbreviations-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-abbreviations-event-notification-queue]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_s3_bucket_notification.xml_second_phase_enriched_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-second-phase-enriched-bucket]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_sqs_queue_policy.replacements-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-queue]
module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_abbreviations_event_source_mapping: Refreshing state... [id=dcc2765f-1f9c-458c-9a52-5abb8037109f]
module.lambda_s3.aws_s3_bucket_notification.xml_original_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-original-bucket]
module.lambda_s3.module.lambda-validate-replacements.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_s3_bucket_notification.xml_third_phase_enriched_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-third-phase-enriched-bucket]
module.lambda_s3.aws_sqs_queue_policy.validation-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-event-notification-queue]
module.data.module.metadata-db.aws_rds_cluster_instance.this[0]: Refreshing state... [id=tna-metadata-db-production-1]
module.data.module.metadata-db.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-2191776492]
module.lambda_s3.module.lambda-update-rules-processor.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw]
module.lambda_s3.module.lambda-update-legislation-table.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation]
module.lambda_s3.aws_s3_bucket_notification.text_content_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-text-content-bucket]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_sqs_queue_policy.replacement-caselaw-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-caselaw-event-notification-queue]
module.lambda_s3.module.lambda-update-rules-processor.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_s3_bucket_notification.rules_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-rules-bucket]
module.lambda_s3.aws_sqs_queue_policy.replacement-legislation-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-legislation-event-notification-queue]
module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_event_source_mapping_caselaw: Refreshing state... [id=cf24034e-11ca-46bf-aa78-a8c54603cfda]
module.lambda_s3.aws_cloudwatch_event_target.update_legislation_table_lambda_target: Refreshing state... [id=update-legislation-table-lambda-event-rule-terraform-20220630135637662100000005]
module.lambda_s3.aws_lambda_permission.allow_cloudwatch_to_call_rw_fallout_retry_step_deletion_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_s3.aws_sns_topic_subscription.validation-error-email-niall-target will be created
  + resource "aws_sns_topic_subscription" "validation-error-email-niall-target" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "niall.roche@mdrx.tech"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic"
    }

  # module.lambda_s3.aws_sqs_queue.fetch_xml_dlq_queue will be created
  + resource "aws_sqs_queue" "fetch_xml_dlq_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 1209600
      + name                              = "tna-s3-tna-production-fetch-xml-dlq-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all                          = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.lambda_s3.aws_sqs_queue.fetch_xml_queue will be created
  + resource "aws_sqs_queue" "fetch_xml_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 1209600
      + name                              = "tna-s3-tna-production-fetch-xml-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all                          = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.lambda_s3.module.lambda-extract-judgement-contents.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/6080a82aba17ef6451f6c18d43423ec457e458254cbba26d5643764730a584ec.zip" -> "builds/a41ce88159786420fc69f17f5b90ec152955aba3147486a45089a43de759da38.zip"
        id                             = "tna-s3-tna-production-extract-judgement-contents"
      ~ last_modified                  = "2022-07-11T13:53:36.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_s3.module.lambda-extract-judgement-contents.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "./lambda/extract_judgement_contents/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/extract_judgement_contents",
                      + null,
                    ],
                ]
              + filename      = "builds/a41ce88159786420fc69f17f5b90ec152955aba3147486a45089a43de759da38.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a41ce88159786420fc69f17f5b90ec152955aba3147486a45089a43de759da38.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_s3.module.lambda-extract-judgement-contents.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "9045320330699222395" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6080a82aba17ef6451f6c18d43423ec457e458254cbba26d5643764730a584ec.zip" -> "builds/a41ce88159786420fc69f17f5b90ec152955aba3147486a45089a43de759da38.zip"
          ~ "timestamp" = "1657547364211284000" -> "1664448308972484200"
        }
    }

  # module.lambda_s3.module.lambda-make-replacements.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8d663b66d5a92a8914257f67e0612180ec9352ce31ba7e2b42cb27a2b2d5abe1.zip" -> "builds/56b2478ec130432898202ab46eae18012424179b3c0d85b21e6ae7fc04caff19.zip"
        id                             = "tna-s3-tna-production-make-replacements"
      ~ last_modified                  = "2022-07-11T13:50:17.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_s3.module.lambda-make-replacements.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "./lambda/make_replacements/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/make_replacements",
                      + null,
                    ],
                ]
              + filename      = "builds/56b2478ec130432898202ab46eae18012424179b3c0d85b21e6ae7fc04caff19.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/56b2478ec130432898202ab46eae18012424179b3c0d85b21e6ae7fc04caff19.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_s3.module.lambda-make-replacements.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1925074530588469736" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8d663b66d5a92a8914257f67e0612180ec9352ce31ba7e2b42cb27a2b2d5abe1.zip" -> "builds/56b2478ec130432898202ab46eae18012424179b3c0d85b21e6ae7fc04caff19.zip"
          ~ "timestamp" = "1657547364221254200" -> "1664448308977861000"
        }
    }

  # module.lambda_s3.module.lambda-update-legislation-table.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/b586afafc97f45646d254a349edc17478724fd6c060cfcdb6bfcaf01dc30bf3c.zip" -> "builds/7a0c2abfe1c168a52cc4e882dd626c7b9115a5ba56ca0908b223ba89fe1fbca2.zip"
        id                             = "tna-s3-tna-production-update-legislation-table"
      ~ last_modified                  = "2022-07-11T13:53:49.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_s3.module.lambda-update-legislation-table.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "./lambda/update_legislation_table/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/update_legislation_table",
                      + null,
                    ],
                ]
              + filename      = "builds/7a0c2abfe1c168a52cc4e882dd626c7b9115a5ba56ca0908b223ba89fe1fbca2.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7a0c2abfe1c168a52cc4e882dd626c7b9115a5ba56ca0908b223ba89fe1fbca2.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_s3.module.lambda-update-legislation-table.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8164697666227387797" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b586afafc97f45646d254a349edc17478724fd6c060cfcdb6bfcaf01dc30bf3c.zip" -> "builds/7a0c2abfe1c168a52cc4e882dd626c7b9115a5ba56ca0908b223ba89fe1fbca2.zip"
          ~ "timestamp" = "1657547364105367800" -> "1664448308968572000"
        }
    }

  # module.lambda_s3.module.lambda-update-rules-processor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tna-s3-tna-production-update-rules-processor"
        tags                           = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SPARQL_PASSWORD"        = ""
              + "SPARQL_USERNAME"        = ""
                # (7 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.lambda_s3.module.lambda-validate-replacements.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1790531596193177970" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1657547364178927000" -> "1664448309026424000"
            # (1 unchanged element hidden)
        }
    }

Plan: 10 to add, 4 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.lambda_s3.module.container_bucket.module.this.aws_s3_bucket.this,
  on .terraform/modules/lambda_s3.container_bucket.this/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 119 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @ak-mdrxtech, Action: `pull_request`*